# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 1]]  # 1-P2/4
  - [-1,1,space_to_depth,[1]]
  - [-1, 6, BiFormerBlock, [256, 8]]
  - [-1, 1, Conv, [64, 3, 1]]  # 3-P3/8
  - [-1,1,space_to_depth,[1]]
  - [-1, 6, BiFormerBlock, [256, 4]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0s head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 12, RepBlock, [512]]  # 13

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 12, RepBlock, [256]]  # 17

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P2
  - [-1, 12, RepBlock, [128]]  # 21

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]  # cat head P3
  - [-1, 12, RepBlock, [256]]  # 24

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 12, RepBlock, [512]]  # 27

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 12, RepBlock, [1024]]  # 30

  - [[23, 26, 29, 32], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
#  - [[23, 26, 29], 1, Detect, [nc]]  # Detect(P2, P3, P4)

